[ 
    {
                
                "title": "Step 1",
                "title2": "Request Magisk Module",
                "desc": "From android 11 and above substratum cant make changes to layout. So it wont work like the way it used to be on android 10!\n\nYou have to request a custom magisk module from the developer for this theme to work! all thanks to google. This module will help you change lockscreen clocks using madness substratum theme.",
                "desc1": "So make sure you request module before doing anything!\nWithout module this theme wont work so please request module before using it.",
                "addon": 1
                
     },
     {
                
                "title": "Step 2",
                "title2": "Flashing The Module",
                "desc": "Once you get the module from dev, You can flash it via Magisk\n\nI repeat, its a magisk module so please flash it via magisk",
                "desc1": "After flashing you can either reboot or proceed to the next step"
                
     },
     {
                
                "title": "Step 3",
                "title2": "Pick A LockScreen Clock",
                "desc": "Now you need to pick lockscreen clock you want use, For that you need to open madness from substratum app and select a clock from -- PICK YOUR CLOCK -- option",
                "desc1": "You can also view clock previews within this app. This will help you identify the clocks you like and will help you pick colors for them\n",
                "url": "https://raw.githubusercontent.com/UnFunnyGuy/Madnessssss/master4d/Walls/maness%20guide%20images/step3_1.jpg",
                "url2": "https://raw.githubusercontent.com/UnFunnyGuy/Madnessssss/master4d/Walls/maness%20guide%20images/step3_2.jpg",
                "addon": 2
     },
     {
                
                "title": "Step 4",
                "title2": "Pick Colors For Clock",
                "desc": "After you select a clock, You need to pick colors for them\n\nThere are 3 attributes available for you to pick. ",
                "desc1": "These 3 attribute decide the colors of the clock you select. You can completely ignore the naming of these 3 attributes on some clock this has nothing to do with background color , text color or outline color.\n\n\nALL YOU SHOULD FOCUS ON WHICH ATTRIBUTES THEME WHICH PART OF THE CLOCK\nThats why clock previews exists! ",
                "desc2": "This is an example from clock preview\n\nAs you can see there are three attributes which is available on the theming section of madness! \n\nBACKGROUND COLOR,TEXT COLOR,OUTLINE COLOR\n\n\nFOR EXAMPLE\n\nBACKGROUND COLOR - Date\nMeans If you pick red as background color, The Date will be in red color.\n\n\nTEXT COLOR - Time\nMeans If you pick green as TEXT COLOR. The time will be in green color.\n\n\nOUTLINE COLOR - Lock icon\nMeans if you pick Yellow as OUTLINE COLOR. The Lock icon will be in yellow color\n\n-This is an example from a clock named IOS-",
                "desc3":"So different clocks have different components, but all are linked to these three attributes which i explained above, this is done on purpose to give the user maximum available freedom for coloring clocks. \nOnce you start changing colors of clocks you will get the hang of it!",
                "desc4": "SPECIAL NOTE\n\nIf you are using substratum lite dont pick both color picker and preset for same attribute\nFirst three options are color picker one, Last 3 is my preset colors\n\nSubstratum lite color picker feature will allow you to use any custom color you want, You can use that if you want or the preset colors that i included",

                "url": "https://raw.githubusercontent.com/UnFunnyGuy/Madnessssss/master4d/Walls/maness%20guide%20images/step4_1.jpg",
                "url2": "https://raw.githubusercontent.com/UnFunnyGuy/EwallsRepo69/main/db/23022022/THUMBS/13150_chroma_Glitch_chroma2_compress2.jpg",
                "addon": 2
     },
     {
                
        "title": "Step 5",
        "title2": "Building Overlay",
        "desc": "After picking clock and its colors you need to build the overlay.\n\nBuild overlay\nReboot\nEnable the overlay you build from substram\n\n\nThats it- You have successfully changed your lockscreen clock",
        "desc1": "NOTE\n\nIf Lockscreen is still blank even after enabling overlay please restart your systemui or reboot again\nif that does not fix your issue please contact me"
        
    },
    {
                
        "title": "Step 6",
        "title2": "Optional Config",
        "desc": "CLOCK MARGIN\n\n\nClock margin moves the clock downwards to more central areas, When building margin overlays its better if you build 3 or more overlays together and reboot once! And try enabling 1 overlay at a time\n\nclock margin left and right does the same thing but sideways\n\n\nNOTE\n\n Some clocks might not move sideways or downwards\n\n",
        "desc1": "Lock screen extra tweaks and row tweaks are meant for 11 and it wont work on oos or A12"
        
    }
     
]